# Configuración general

In [8]:
import sqlite3 
import os
import pandas as pd

In [9]:
# Paths 
wd = os.getcwd()
db = "adventureworks_sql_lite.sqlite"
db_path = os.path.join(wd, db)

In [10]:
# Función para poder ver la query en Python 

def mostrar_query (query, limite = 3, dataset = True):
    cursor.execute(query)
    columnas = [desc[0] for desc in cursor.description]
    filas = cursor.fetchmany(limite)
    try:
        if dataset:
            dataset_final = pd.DataFrame(filas, columns=columnas)
            return dataset_final
        else:
            return filas
    except Exception as e:
        print (f"No se puede mostrar la consulta, la palida es: {e}")

In [11]:
# Conexión base de datos con sqlite3

conn = sqlite3.connect(db_path)
cursor = conn.cursor()

# Ejercicios

## 1. Consultas simples: SELECT, FROM, WHERE, LIMIT

In [12]:
# 1. Mostrar el contenido de la tabla Person, del esquema Person.

mostrar_query("""SELECT * 
              from 'Person.Person' p""")

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,0,,Ken,J,Sánchez,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07 00:00:00
1,2,EM,0,,Terri,Lee,Duffy,,1,,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24 00:00:00
2,3,EM,0,,Roberto,,Tamburello,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04 00:00:00

In [13]:
# 2. Mostrar los nombres y apelllido de cada persona que tenga como tratamiento “Ms.”

mostrar_query("""
SELECT p.FirstName, p.LastName
FROM 'Person.Person' p
WHERE p.Title LIKE 'Ms%'
""")

  FirstName  LastName
0      Gail  Erickson
1    Janice    Galvin
2      Jill  Williams

In [14]:
#3. Personas con “Mr.” y apellido “White”

mostrar_query("""
SELECT *
FROM 'Person.Person' p
WHERE p.Title LIKE 'Mr%' COLLATE NOCASE
  AND p.LastName LIKE '%White' COLLATE NOCASE
""")

Empty DataFrame
Columns: [BusinessEntityID, PersonType, NameStyle, Title, FirstName, MiddleName, LastName, Suffix, EmailPromotion, AdditionalContactInfo, Demographics, rowguid, ModifiedDate]
Index: []

In [15]:
# 5. Mostrar los datos de las personas que tengan asignado el tipo “SP” ó el tipo “VC”.

mostrar_query("""
SELECT * 
FROM 'Person.Person' p
WHERE p.PersonType LIKE 'EM' OR p.PersonType LIKE 'VC'
""")

,BusinessEntityID,PersonType,NameStyle,Title,FirstName,MiddleName,LastName,Suffix,EmailPromotion,AdditionalContactInfo,Demographics,rowguid,ModifiedDate
0,1,EM,0,,Ken,J,Sánchez,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",92C4279F-1207-48A3-8448-4636514EB7E2,2009-01-07 00:00:00
1,2,EM,0,,Terri,Lee,Duffy,,1,,"<IndividualSurvey xmlns=""http://schemas.micros...",D8763459-8AA8-47CC-AFF7-C9079AF79033,2008-01-24 00:00:00
2,3,EM,0,,Roberto,,Tamburello,,0,,"<IndividualSurvey xmlns=""http://schemas.micros...",E1A2555E-0828-434B-A33B-6F38136A37DE,2007-11-04 00:00:00

In [16]:
#6. Mostrar el contenido de la tabla Employee, del esquema HumanResources

mostrar_query("""
SELECT * 
FROM 'HumanResources.Employee' AS e
""")

,BusinessEntityID,NationalIDNumber,LoginID,OrganizationNode,OrganizationLevel,JobTitle,BirthDate,MaritalStatus,Gender,HireDate,SalariedFlag,VacationHours,SickLeaveHours,CurrentFlag,rowguid,ModifiedDate
0,1,295847284,adventure-works\ken0,,,Chief Executive Officer,1969-01-29,S,M,2009-01-14,1,99,69,1,F01251E5-96A3-448D-981E-0F99D789110D,2014-06-30 00:00:00
1,2,245797967,adventure-works\terri0,58,1,Vice President of Engineering,1971-08-01,S,F,2008-01-31,1,1,20,1,45E8F437-670D-4409-93CB-F9424A40D6EE,2014-06-30 00:00:00
2,3,509647174,adventure-works\roberto0,5AC0,2,Engineering Manager,1974-11-12,M,M,2007-11-11,1,2,21,1,9BBBFB2C-EFBB-4217-9AB7-F97689328841,2014-06-30 00:00:00

In [17]:
# 7. Hallar el Id y fecha de nacimiento de los empleados que tengan como función “Research and
# Development Manager” y que tengan menos de 10 “VacationHours”.


mostrar_query("""
SELECT e.BusinessEntityID AS id
FROM 'HumanResources.Employee' e
WHERE e.JobTitle = 'Research and Development Manager'
  AND e.VacationHours < 10
""")

Empty DataFrame
Columns: [id]
Index: []

In [18]:
# 8. ¿Cuáles son los tipos de “género” que figuran en la tabla de empleados?

mostrar_query("""
SELECT DISTINCT e.Gender 
FROM 'HumanResources.Employee' AS e
""")

  Gender
0      M
1      F

In [19]:
# 9. Mostrar el id, nombres, apellido de los empleados ordenados desde el de fecha de nacimiento
# más antigua.


mostrar_query("""
SELECT p.BusinessEntityID AS id, p.FirstName, p.LastName
FROM 'HumanResources.Employee' AS e
JOIN 'Person.Person' AS p ON e.BusinessEntityID = p.BusinessEntityID
ORDER BY e.BirthDate ASC
""")

   id FirstName  LastName
0  84     Frank  Martinez
1   5      Gail  Erickson
2  63    Maciej     Dusza

In [20]:
#10.Mostrar el contenido de la tabla Departments


mostrar_query("""
SELECT * 
FROM 'HumanResources.Department' AS d
""")

  DepartmentID         Name                 GroupName         ModifiedDate
0            1  Engineering  Research and Development  2008-04-30 00:00:00
1            2  Tool Design  Research and Development  2008-04-30 00:00:00
2            3        Sales       Sales and Marketing  2008-04-30 00:00:00

In [22]:
#11.¿Cuáles son los departamentos que están agrupados como “Manufacturing” ó como “Quality
#Assurance”?

mostrar_query("""
SELECT * 
FROM 'HumanResources.Department' AS d
WHERE d.GroupName = 'Manufacturing' OR d.GroupName = 'Quality Assurance'
""")

  DepartmentID                Name          GroupName         ModifiedDate
0            7          Production      Manufacturing  2008-04-30 00:00:00
1            8  Production Control      Manufacturing  2008-04-30 00:00:00
2           12    Document Control  Quality Assurance  2008-04-30 00:00:00

In [23]:
# Ejercicio 12 - ¿Cuáles son los datos de los departamentos cuyo nombre esté relacionado con “Production”?
mostrar_query(""" 
SELECT * 
FROM 'HumanResources.Department' AS d
WHERE d.Name LIKE 'Production'
""")

  DepartmentID        Name      GroupName         ModifiedDate
0            7  Production  Manufacturing  2008-04-30 00:00:00

In [24]:
# Ejercicio 13 - Mostrar los datos de los departamentos que no estén agrupados como “Research and Develpment”
mostrar_query(""" 
SELECT * 
FROM 'HumanResources.Department' AS d
WHERE d.Name NOT LIKE 'Research and Develpment'
""")

  DepartmentID         Name                 GroupName         ModifiedDate
0            1  Engineering  Research and Development  2008-04-30 00:00:00
1            2  Tool Design  Research and Development  2008-04-30 00:00:00
2            3        Sales       Sales and Marketing  2008-04-30 00:00:00

In [25]:
# Ejercicio 14 - Mostrar los datos de la tabla Product del esquema Production
mostrar_query(""" 
SELECT * 
FROM 'Production.Product' AS p
""")

,ProductID,Name,ProductNumber,MakeFlag,FinishedGoodsFlag,Color,SafetyStockLevel,ReorderPoint,StandardCost,ListPrice,...,ProductLine,Class,Style,ProductSubcategoryID,ProductModelID,SellStartDate,SellEndDate,DiscontinuedDate,rowguid,ModifiedDate
0,1,Adjustable Race,AR-5381,0,0,,1000,750,0.0000,0.0000,...,,,,,,2008-04-30 00:00:00,,,694215B7-08F7-4C0D-ACB1-D734BA44C0C8,2014-02-08 10:01:36
1,2,Bearing Ball,BA-8327,0,0,,1000,750,0.0000,0.0000,...,,,,,,2008-04-30 00:00:00,,,58AE3C20-4F3A-4749-A7D4-D568806CC537,2014-02-08 10:01:36
2,3,BB Ball Bearing,BE-2349,1,0,,800,600,0.0000,0.0000,...,,,,,,2008-04-30 00:00:00,,,9C21AED2-5BFA-4F18-BCB8-F11638DC2E4E,2014-02-08 10:01:36

In [26]:
# Ejercicio 15 - Hallar los productos que no tengan asignado color.
mostrar_query(""" 
SELECT * 
FROM 'Production.Product' AS p
WHERE p.Color IS NULL
""")

Empty DataFrame
Columns: [ProductID, Name, ProductNumber, MakeFlag, FinishedGoodsFlag, Color, SafetyStockLevel, ReorderPoint, StandardCost, ListPrice, Size, SizeUnitMeasureCode, WeightUnitMeasureCode, Weight, DaysToManufacture, ProductLine, Class, Style, ProductSubcategoryID, ProductModelID, SellStartDate, SellEndDate, DiscontinuedDate, rowguid, ModifiedDate]
Index: []

[0 rows x 25 columns]

In [27]:
# Ejercicio 16 - Para todos los productos que tengan asignado algún color y que tengan un stock (SafetyStockLevel) mayor a 900, 
# mostrar su id, nombre y color. Ordenarlo por id descendente y por color ascendente.
mostrar_query(""" 
SELECT p.ProductID, p.Name, p.Color 
FROM 'Production.Product' AS p
WHERE p.Color IS NOT NULL AND p.SafetyStockLevel > 900
ORDER BY p.ProductID DESC, p.Color ASC
""")

  ProductID                    Name Color
0       421  Internal Lock Washer 2
1       420  Internal Lock Washer 8
2       419  Internal Lock Washer 1

In [28]:
# Ejercicio 17 - Hallar el Id y el nombre de los productos cuyo nombre comience con “Chain”
mostrar_query(""" 
SELECT p.ProductID, p.Name 
FROM 'Production.Product' AS p
WHERE p.Name LIKE 'Chain%'
""")

  ProductID             Name
0       320  Chainring Bolts
1       321    Chainring Nut
2       322        Chainring

In [29]:
# Ejercicio 18 - Hallar el Id y el nombre de los productos cuyo nombre contenga “helmet”
mostrar_query(""" 
SELECT p.ProductID, p.Name 
FROM 'Production.Product' AS p
WHERE p.Name LIKE '%helmet%'
""")

Empty DataFrame
Columns: [ProductID, Name]
Index: []

In [ ]:
# Ejercicio 19 - Modificar la consulta anterior para que retorne aquellos productos cuyo nombre no contenga “helmet”
mostrar_query(""" 
SELECT p.ProductID, p.Name 
FROM 'Production.Product' AS p
WHERE p.Name NOT LIKE '%helmet%'
""")

In [30]:
# Ejercicio 20 - Mostrar los datos principales de las personas (tabla Person) cuyo LastName termine con “es” y contenga en total 5 caracteres.
mostrar_query(""" 
SELECT * 
FROM 'Person.Person' AS p
WHERE p.LastName LIKE '___es'
""")

Empty DataFrame
Columns: [BusinessEntityID, PersonType, NameStyle, Title, FirstName, MiddleName, LastName, Suffix, EmailPromotion, AdditionalContactInfo, Demographics, rowguid, ModifiedDate]
Index: []

In [31]:
# Ejercicio 21 - Usando la tabla SpecialOffer del esquema Sales, mostrar la diferencia entre MinQty y MaxQty, con el id y descripción.
mostrar_query(""" 
SELECT so.SpecialOfferID, so.Description, so.MaxQty - so.MinQty AS DeltaQty
FROM 'Sales.SpecialOffer' AS so
""")

  SpecialOfferID               Description  DeltaQty
0              1               No Discount         0
1              2  Volume Discount 11 to 14         3
2              3  Volume Discount 15 to 24         9

In [32]:
# Ejercicio 23 - Para resolver el problema anterior, usar la función ISNULL para, cuando no tengan asignado valor, reemplazarlo en el cálculo por 0 (cero).
mostrar_query(""" 
SELECT 
  IFNULL(so.MaxQty, 0) - IFNULL(so.MinQty, 0) AS DeltaQty
FROM 'Sales.SpecialOffer' AS so
""")

   DeltaQty
0         0
1         3
2         9